---
type: LineProperties
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# LineProperties

`Autodesk.Revit.DB.LineProperties` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Color | 2016 | `public Color Color { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LineWidth | 2016 | `public double LineWidth { get ; }` |
| Property | PatternId | 2016 | `public ElementId PatternId { get ; }` |
| Property | Transparency | 2016 | `public int Transparency { get ; }` |